<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>星爷的背影变小了 | 宽视角</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="那个你快回来，80后需要你，也许都需要呢">
<meta property="og:type" content="article">
<meta property="og:title" content="星爷的背影变小了">
<meta property="og:url" content="http://yoursite.com/2016/08/01/axing/index.html">
<meta property="og:site_name" content="宽视角">
<meta property="og:description" content="那个你快回来，80后需要你，也许都需要呢">
<meta property="og:image" content="http://yoursite.com/2016/08/01/axing/wukong.jpg">
<meta property="og:updated_time" content="2016-08-02T14:48:06.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="星爷的背影变小了">
<meta name="twitter:description" content="那个你快回来，80后需要你，也许都需要呢">
<meta name="twitter:image" content="http://yoursite.com/2016/08/01/axing/wukong.jpg">
  
    <link rel="alternative" href="/atom.xml" title="宽视角" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link rel="stylesheet" href="/css/style.css">
</head>

<body>
  <div id="container">
    <div class="left-col">
    <div class="overlay"></div>
<div class="intrude-less">
	
		<form class="search" action="/search/index.html" method="get" accept-charset="utf-8">
			<label>Search</label>
			<input type="text" id="st-search-input" class="st-default-search-input st-search-input_my" maxlength="30" placeholder="Search" />
		</form>
	
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img lazy-src="https://avatars1.githubusercontent.com/u/4168558?v=3&amp;s=460" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">listen</a></h1>
		</hgroup>

		
		<p class="header-subtitle">年轻是什么？就是越挫越勇！</p>
		

		
			<div class="switch-btn">
				<div class="icon">
					<div class="icon-ctn">
						<div class="icon-wrap icon-house" data-idx="0">
							<div class="birdhouse"></div>
							<div class="birdhouse_holes"></div>
						</div>
						<div class="icon-wrap icon-ribbon hide" data-idx="1">
							<div class="ribbon"></div>
						</div>
						
						<div class="icon-wrap icon-link hide" data-idx="2">
							<div class="loopback_l"></div>
							<div class="loopback_r"></div>
						</div>
						
						
					</div>
					
				</div>
				<div class="tips-box hide">
					<div class="tips-arrow"></div>
					<ul class="tips-inner">
						<li>Menu</li>
						<li>Tags</li>
						
						<li>Links</li>
						
						
					</ul>
				</div>
			</div>
		

		<div class="switch-area">
			<div class="switch-wrap">
				<section class="switch-part switch-part1">
					<nav class="header-menu">
						<ul>
						
							<li><a href="/">主页</a></li>
				        
							<li><a href="/archives">所有文章</a></li>
				        
						</ul>
					</nav>
					<nav class="header-nav">
						<div class="social">
							
								<a class="github" target="_blank" href="https://github.com/listen-lavender" title="github">github</a>
					        
						</div>
					</nav>
				</section>
				
				
				<section class="switch-part switch-part2">
					<div class="widget tagcloud" id="js-tagcloud">
						<a href="/tags/" style="font-size: 10px;">==</a> <a href="/tags/Newton-iteration/" style="font-size: 10px;">Newton iteration</a> <a href="/tags/async-task/" style="font-size: 10px;">async task</a> <a href="/tags/beanstalkd/" style="font-size: 10px;">beanstalkd</a> <a href="/tags/binary-search/" style="font-size: 10px;">binary search</a> <a href="/tags/bitmap/" style="font-size: 10px;">bitmap</a> <a href="/tags/brpop/" style="font-size: 10px;">brpop</a> <a href="/tags/hash优化/" style="font-size: 10px;">hash优化</a> <a href="/tags/is/" style="font-size: 10px;">is</a> <a href="/tags/level/" style="font-size: 20px;">level</a> <a href="/tags/lpush/" style="font-size: 10px;">lpush</a> <a href="/tags/lxml/" style="font-size: 10px;">lxml</a> <a href="/tags/mongo/" style="font-size: 10px;">mongo</a> <a href="/tags/mongo-id/" style="font-size: 10px;">mongo_id</a> <a href="/tags/monitor/" style="font-size: 10px;">monitor</a> <a href="/tags/phantomjs/" style="font-size: 10px;">phantomjs</a> <a href="/tags/powerful/" style="font-size: 10px;">powerful</a> <a href="/tags/priority/" style="font-size: 20px;">priority</a> <a href="/tags/python/" style="font-size: 10px;">python</a> <a href="/tags/queue/" style="font-size: 10px;">queue</a> <a href="/tags/redis/" style="font-size: 10px;">redis</a> <a href="/tags/requests/" style="font-size: 10px;">requests</a> <a href="/tags/sqrt/" style="font-size: 10px;">sqrt</a> <a href="/tags/weight/" style="font-size: 10px;">weight</a> <a href="/tags/优先级/" style="font-size: 10px;">优先级</a> <a href="/tags/使用场景/" style="font-size: 10px;">使用场景</a> <a href="/tags/分布式/" style="font-size: 10px;">分布式</a> <a href="/tags/分类/" style="font-size: 10px;">分类</a> <a href="/tags/匿名变量/" style="font-size: 10px;">匿名变量</a> <a href="/tags/周星驰/" style="font-size: 20px;">周星驰</a> <a href="/tags/性能/" style="font-size: 10px;">性能</a> <a href="/tags/排序/" style="font-size: 10px;">排序</a> <a href="/tags/条件查询/" style="font-size: 10px;">条件查询</a> <a href="/tags/浮夸/" style="font-size: 20px;">浮夸</a> <a href="/tags/状态/" style="font-size: 10px;">状态</a> <a href="/tags/自虐/" style="font-size: 20px;">自虐</a> <a href="/tags/阻塞完成/" style="font-size: 10px;">阻塞完成</a>
					</div>
				</section>
				
				
				
				<section class="switch-part switch-part3">
					<div id="js-friends">
					
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://braavos.me/">落在深海</a>
			        
			          <a target="_blank" class="main-nav-link switch-friends-link" href="http://sanyuesha.com/">三月沙</a>
			        
			        </div>
				</section>
				

				
			</div>
		</div>
	</header>				
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"></div>
  		<h1 class="header-author js-mobile-header hide">listen</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
			
				<img lazy-src="https://avatars1.githubusercontent.com/u/4168558?v=3&amp;s=460" class="js-avatar">
			
			</div>
			<hgroup>
			  <h1 class="header-author">listen</h1>
			</hgroup>
			
			<p class="header-subtitle">年轻是什么？就是越挫越勇！</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/archives">所有文章</a></li>
		        
		        <div class="clearfix"></div>
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/listen-lavender" title="github">github</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap"><article id="post-axing" class="article article-type-post" itemscope itemprop="blogPost">
  
    <div class="article-meta">
      <a href="/2016/08/01/axing/" class="article-date">
  	<time datetime="2016-08-01T01:45:37.000Z" itemprop="datePublished">2016-08-01</time>
</a>
    </div>
  
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      星爷的背影变小了
    </h1>
  

      </header>
      
      <div class="article-info article-info-post">
        
	<div class="article-tag tagcloud">
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/周星驰/">周星驰</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/浮夸/">浮夸</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/自虐/">自虐</a></li></ul>
	</div>

        
	<div class="article-category tagcloud">
	<a class="article-category-link" href="/categories/杂货/">杂货</a>
	</div>


        <div class="clearfix"></div>
      </div>
      
    
    <div class="article-entry" itemprop="articleBody">
      
        <style>
    p{text-indent: 2em;}
    img[title="wukong"] {width: 95%;}
</style>

<center style="font-size:2em;">&#x54A6; &#x661F;&#x7237;&#x7684;&#x80CC;&#x5F71;&#x53D8;&#x5C0F;&#x4E86;</center>

<p><img src="/2016/08/01/axing/wukong.jpg" alt="wukong"></p>
<p>&#x6D6E;&#x5938;&#x81EA;&#x8650;&#x8650;&#x4ED6;&#x7684;&#x8349;&#x6839;&#x5F62;&#x6001;&#x548C;&#x8D64;&#x88F8;&#x88F8;&#x7684;&#x771F;&#x6211;&#x662F;&#x661F;&#x7237;&#x7535;&#x5F71;&#x7684;&#x7CBE;&#x534E;&#xFF0C;&#x53C8;&#x53EB;&#x65E0;&#x5398;&#x5934;&#xFF0C;&#x6BD4;&#x9C81;&#x8FC5;&#x773C;&#x91CC;&#x7684;&#x963F;Q&#xFF0C;&#x8981;&#x9163;&#x7545;&#x6DCB;&#x6F13;&#xFF0C;&#x597D;&#x6BD4;&#x963F;Q&#x662F;&#x4E00;&#x53EA;&#x5728;&#x4EBA;&#x7FA4;&#x5939;&#x7F1D;&#x91CC;&#x9762;&#x72FC;&#x72C8;&#x4E71;&#x7A9C;&#x7684;&#x843D;&#x6C34;&#x72D7;&#xFF0C;&#x800C;&#x963F;&#x661F;&#x662F;&#x4E00;&#x76F4;&#x96C4;&#x8D73;&#x8D73;&#x3001;&#x6C14;&#x6602;&#x6602;&#x7684;&#x843D;&#x6C34;&#x72D7;&#xFF0C;&#x8FB9;&#x6296;&#x7740;&#x8EAB;&#x4E0A;&#x7684;&#x6C34;&#xFF0C;&#x8FB9;&#x53EB;&#x9053;&#xFF1A;&#x201C;&#x6211;&#x843D;&#x6C34;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x5FEB;&#x6765;&#x6253;&#x6211;&#x554A;&#xFF0C;&#x597D;&#x597D;&#x7B11;&#x3002;&#x201D;</p>
<p>&#x76F8;&#x5F62;&#x4E4B;&#x884C;&#xFF0C;&#x9C81;&#x8FC5;&#x6307;&#x51FA;&#x4E86;&#x767E;&#x59D3;&#x7684;&#x52A3;&#x6839;&#x6027;&#xFF1B;&#x800C;&#x661F;&#x7237;&#x8BF4;&#x52A3;&#x6839;&#x6027;&#x7684;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x81EA;&#x5F3A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5FEB;&#x4E50;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7CBE;&#x5F69;&#x3002;&#x5728;&#x67D0;&#x79CD;&#x4E16;&#x754C;&#x5F62;&#x6001;&#x91CC;&#xFF0C;&#x9C81;&#x8FC5;&#x7559;&#x4E0B;&#x7684;&#x662F;&#x4E00;&#x526F;&#x82E6;&#x836F;&#xFF0C;&#x8BA9;&#x4EBA;&#x65E0;&#x5730;&#x81EA;&#x5BB9;&#xFF1B;&#x661F;&#x7237;&#x5374;&#x620F;&#x8C11;&#x5730;&#x8D5E;&#x4ED6;&#x53EF;&#x7231;&#xFF0C;&#x8BA9;&#x867E;&#x7C73;&#x4EEC;&#x518D;&#x5EA6;&#x6D3B;&#x8E66;&#x4E71;&#x8DF3;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x867E;&#x7C73;&#x4EEC;&#x8D77;&#x8EAB;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5374;&#x662F;&#x661F;&#x7237;&#x6E10;&#x884C;&#x6E10;&#x8FDC;&#x6E10;&#x8001;&#x7684;&#x80CC;&#x5F71;&#x3002;</p>
<p>&#x6211;&#x8BB0;&#x5F97;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x5230;&#x661F;&#x7237;&#x7684;&#x7535;&#x5F71;&#x662F;&#x300A;&#x5927;&#x8BDD;&#x897F;&#x6E38;&#x2022;&#x6708;&#x5149;&#x5B9D;&#x76D2;&#x300B;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x4E94;&#x5E74;&#x7EA7;&#x7684;&#x65F6;&#x5019;&#x5427;&#xFF0C;&#x6211;&#x548C;&#x8868;&#x59D0;&#x91C7;&#x5B8C;&#x8336;&#xFF0C;&#x56DE;&#x5230;&#x5BB6;&#x91CC;&#xFF0C;&#x770B;&#x5230;14&#x5BF8;&#x7684;&#x9ED1;&#x767D;&#x7535;&#x89C6;&#x4E0A;&#x6B63;&#x5728;&#x64AD;&#xFF0C;&#x5F53;&#x65F6;&#x89C9;&#x5F97;&#x5B59;&#x609F;&#x7A7A;&#x7684;&#x9020;&#x578B;&#x5B9E;&#x5728;&#x662F;&#x6CA1;&#x6709;&#x516D;&#x5C0F;&#x9F84;&#x7AE5;&#x7684;&#x7F8E;&#x611F;&#x554A;&#xFF0C;&#x75AF;&#x75AF;&#x766B;&#x766B;&#x7684;&#x5BF9;&#x767D;&#x5570;&#x91CC;&#x5570;&#x55E6;&#xFF0C;&#x97F3;&#x4E50;&#x9020;&#x578B;&#x5462;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x5531;&#x620F;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#x548C;&#x6253;&#x6597;&#x573A;&#x9762;&#x8FDC;&#x4E0D;&#x5982;&#x91D1;&#x5EB8;&#x7684;&#x6D41;&#x7545;&#x7CBE;&#x5F69;&#x3002;&#x90A3;&#x4E00;&#x904D;&#x771F;&#x6CA1;&#x7559;&#x4E0B;&#x4EC0;&#x4E48;&#x5370;&#x8C61;&#xFF0C;&#x6216;&#x8005;&#x597D;&#x5370;&#x8C61;&#xFF0C;&#x54EA;&#x77E5;&#x82E5;&#x5E72;&#x5E74;&#x4EE5;&#x540E;&#x88AB;&#x611F;&#x52A8;&#x5F97;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#x3002;</p>
<blockquote>
<p>&#x4EE5;&#x4E0B;&#x662F;1992-2004&#x90E8;&#x5206;&#x4F5C;&#x54C1;</p>
</blockquote>
<ul>
<li><p><strong>&#x5BA1;&#x6B7B;&#x5B98;&#x3001;&#x4E5D;&#x54C1;&#x829D;&#x9EBB;&#x5B98;</strong>&#xFF0C;&#x90FD;&#x662F;&#x5BF9;&#x4F53;&#x5236;&#x6743;&#x529B;&#x7684;&#x8BBD;&#x523A;&#xFF0C;&#x65E0;&#x5948;&#x7684;&#x8D25;&#x7B14;&#x662F;&#x6700;&#x540E;&#x80DC;&#x5229;&#x4E5F;&#x8981;&#x4F9D;&#x9760;&#x66F4;&#x9AD8;&#x7684;&#x6743;&#x529B;&#x3002;&#x8FD9;&#x4E24;&#x90E8;&#x7535;&#x5F71;&#x629B;&#x5F03;&#x8FC7;&#x5F80;&#x5BA1;&#x6848;&#x5267;&#x91CC;&#x90A3;&#x79CD;&#x51DB;&#x7136;&#x6B63;&#x6C14;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x4F8B;&#x5982;&#x6837;&#x677F;&#x5316;&#x7684;&#x300A;&#x5305;&#x9752;&#x5929;&#x300B;&#xFF0C;&#x800C;&#x662F;&#x51F8;&#x51FA;&#x667A;&#x6597;&#x5978;&#x90AA;&#xFF0C;&#x501F;&#x529B;&#x6253;&#x529B;&#x7684;&#x8F9B;&#x9178;&#x5386;&#x7A0B;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x4F53;&#x73B0;&#x903B;&#x8F91;&#x548C;&#x6C11;&#x5FC3;&#x6240;&#x95EE;&#x3002;<br>  &#x7ECF;&#x5178;&#x6865;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x8D22;&#x4E3B;&#x627E;&#x5B8B;&#x4E16;&#x6770;&#x5E2E;&#x6709;&#x7F6A;&#x7684;&#x513F;&#x5B50;&#x6253;&#x5B98;&#x53F8;&#xFF0C;&#x62FF;&#x51FA;&#x4E00;&#x7BB1;&#x94F6;&#x5B50;&#xFF0C;&#x5B8B;&#x4E16;&#x6770;&#x4E0D;&#x5C51;&#x4E00;&#x987E;&#xFF0C;&#x8D22;&#x4E3B;&#x62FF;&#x51FA;&#x4E00;&#x7BB1;&#x91D1;&#x5B50;&#xFF0C;&#x5B8B;&#x4E16;&#x6770;&#x7565;&#x6709;&#x89E6;&#x52A8;&#xFF0C;&#x8D22;&#x4E3B;&#x51FA;&#x4E24;&#x8F66;&#x9EC4;&#x91D1;&#x3002;&#x5B8B;&#x4E16;&#x6770;&#x575A;&#x5B9A;&#x8FC5;&#x901F;&#x63A5;&#x9053;&#xFF1A;&#x201C;&#x90A3;&#x600E;&#x4E48;&#x884C;&#xFF01;&#x201D;&#x5B8B;&#x59BB;&#x5927;&#x559C;&#x8001;&#x516C;&#x6709;&#x9AA8;&#x6C14;&#xFF0C;&#x5B8B;&#x4E16;&#x6770;&#x5374;&#x53C8;&#x8BF4;&#x4E86;&#x53E5;&#x8BA9;&#x6240;&#x6709;&#x4EBA;&#x7EDD;&#x5012;&#x7684;&#x8BDD;&#xFF1A;&#x201C;&#x8F93;&#x4E86;&#x6211;&#x4E5F;&#x8981;&#x4E00;&#x534A;&#xFF01;&#x201D;</li>
<li>&#x5B8B;&#x4E16;&#x6770;&#x5728;&#x8859;&#x95E8;&#x724C;&#x533E;&#x201C;&#x5149;&#x660E;&#x6B63;&#x5927;&#x201D;&#x56DB;&#x4E2A;&#x5B57;&#x4E0B;&#x6D41;&#x4E86;&#x773C;&#x6CEA;&#xFF0C;&#x611F;&#x6168;&#x9053;&#xFF1A;&#x201C;&#x5B98;&#x554A;&#xFF01;&#x2026;..&#x201D;</li>
<li>&#x5305;&#x9F99;&#x661F;&#x62FF;&#x51FA;&#x4E00;&#x6761;&#x5185;&#x88E4;&#x9053;&#xFF1A;&#x201C;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x660E;&#x5929;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x5168;&#x591A;&#x5F97;&#x7687;&#x4E0A;&#x9009;&#x62D4;&#xFF0C;&#x6211;&#x5BF9;&#x4ED6;&#x5462;&#xFF0C;&#x975E;&#x5E38;&#x60E6;&#x5FF5;&#xFF0C;&#x8FD8;&#x597D;&#x6211;&#x6536;&#x85CF;&#x4E86;&#x4E00;&#x6761;&#x7687;&#x4E0A;&#x7684;&#x9F99;&#x5185;&#x88E4;&#xFF0C;&#x95FB;&#x4E00;&#x95FB;&#xFF0C;&#x7CBE;&#x795E;&#x767E;&#x500D;&#xFF0C;&#x6296;&#x4E00;&#x6296;&#xFF0C;&#x751F;&#x52A8;&#x7B4B;&#x9AA8;&#xFF0C;&#x8214;&#x4E00;&#x8214;&#xFF0C;&#x4E0D;&#x4F1A;&#x56DB;&#x5904;&#x4E71;&#x6446;&#x3002;&#x6765;&#xFF0C;&#x95FB;&#x4E00;&#x95FB;&#x3002;&#x201D;&#x8001;&#x677F;&#x5A18;&#xFF1A;&#x201C;&#x6069;&#x3002;&#x201D;&#x4EC6;&#x4EBA;&#x9053;&#xFF1A;&#x201C;&#x606C;&#x4EB2;&#x738B;&#x5230;&#x3002;&#x201D;&#x5305;&#x9F99;&#x661F;&#xFF1A;&#x201C;&#x738B;&#x7237;&#x5927;&#x9A7E;&#x5149;&#x4E34;&#xFF0C;&#x6709;&#x5931;&#x8FDC;&#x8FCE;&#xFF0C;&#x6055;&#x7F6A;&#xFF0C;&#x6055;&#x7F6A;&#x3002;&#x201D;&#x606C;&#x4EB2;&#x738B;&#x9053;&#xFF1A;&#x201C;&#x4E0D;&#x5FC5;&#x591A;&#x793C;&#xFF0C;&#x660E;&#x5929;&#x4F60;&#x5F00;&#x4E1A;&#xFF0C;&#x6211;&#x4E0D;&#x80FD;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x8981;&#x544A;&#x77E5;&#x4F60;&#x4E00;&#x4E2A;&#x574F;&#x6D88;&#x606F;&#xFF0C;&#x7687;&#x4E0A;&#x9A7E;&#x5D29;&#x4E86;&#x3002;&#x201D;&#x5305;&#x9F99;&#x661F;&#x7528;&#x9F99;&#x5185;&#x88E4;&#x64E6;&#x6CEA;&#xFF1A;&#x201C;&#x554A;&#xFF01;&#x7687;&#x4E0A;&#x600E;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF1F;&#x600E;&#x4E48;&#x8FD9;&#x6837;&#xFF1F;&#x7687;&#x4E0A;&#x600E;&#x4E48;&#x4F1A;&#x9A7E;&#x5D29;&#x5462;&#xFF1F;&#x201D;&#x606C;&#x4EB2;&#x738B;&#xFF1A;&#x201C;&#x751F;&#x75C5;&#x4E86;&#x3002;&#x201D;&#x5305;&#x9F99;&#x661F;&#xFF1A;&#x201C;&#x4EC0;&#x4E48;&#x75C5;&#x5440;&#xFF1F; &#x201D;&#x606C;&#x4EB2;&#x738B;&#xFF1A;&#x201C;&#x662F;&#x82B1;&#x67F3;&#x75C5;&#x3002;&#x201D;&#x5305;&#x9F99;&#x661F;&#xFF1A;&#x201C;&#x54CE;&#x5440;&#x3002;&#x201D;&#x8D76;&#x7D27;&#x6254;&#x6389;&#x9F99;&#x5185;&#x88E4;&#x3002;</li>
</ul>
</li>
<li><p><strong>&#x5510;&#x4F2F;&#x864E;&#x70B9;&#x79CB;&#x9999;&#x3001;&#x6708;&#x5149;&#x5B9D;&#x76D2;&#x3001;&#x4ED9;&#x5C65;&#x5947;&#x7F18;</strong>&#x5BF9;&#x8001;&#x4F20;&#x8BF4;&#x6539;&#x7F16;&#xFF0C;&#x65E0;&#x7591;&#xFF0C;&#x53EA;&#x6709;&#x661F;&#x7237;&#x624D;&#x80FD;&#x6539;&#x7F16;&#x5F97;&#x8FD9;&#x4E48;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E48;&#x8BA9;&#x4EBA;&#x56DE;&#x5473;&#x3002;<br>  &#x7ECF;&#x5178;&#x6865;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x65FA;&#x8D22;&#x548C;&#x5C0F;&#x5F3A;&#xFF0C;&#x5BF9;&#x793E;&#x4F1A;&#x75C5;&#x6001;&#x6BD4;&#x60E8;&#x7684;&#x8BBD;&#x523A;&#xFF0C;&#x6551;&#x6D4E;&#x7A77;&#x5F31;&#x9700;&#x8981;&#x4E00;&#x5957;&#x5408;&#x7406;&#x5B8C;&#x5584;&#x7684;&#x5236;&#x5EA6;&#x52A9;&#x4EBA;&#x81EA;&#x5F3A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F5C;&#x79C0;&#x6216;&#x8005;&#x9009;&#x79C0;&#xFF0C;&#x4F8B;&#x5982;&#x6700;&#x60E8;&#x6700;&#x8D2B;&#x56F0;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x4E3B;&#x89C2;&#x5730;&#x5E72;&#x6D89;&#x3002;</li>
<li>&#x6253;&#x52AB;&#x811A;&#x5E95;&#x677F;&#xFF0C;&#x4E8C;&#x90CE;&#x795E;&#x7684;&#x54EE;&#x5929;&#x72AC;&#x5954;&#x7740;&#x6BCD;&#x72D7;&#x53BB;&#x2026;..&#x90FD;&#x662F;&#x521B;&#x610F;&#x554A;&#x3002;</li>
<li>&#x4E00;&#x4E07;&#x5E74;&#x7684;&#x8A93;&#x8A00;&#xFF0C;&#x662F;&#x6D51;&#x5C0F;&#x5B50;&#x7684;&#x6700;&#x7231;&#x3002;</li>
<li>&#x7D2B;&#x971E;&#x4ED9;&#x5B50;&#xFF1A;&#x201C;&#x4F60;&#x770B;&#x90A3;&#x4E2A;&#x4EBA;&#xFF0C;&#x597D;&#x5947;&#x602A;&#x54DF;&#xFF0C;&#x50CF;&#x4E00;&#x6761;&#x72D7;&#x3002;&#x201D;</li>
<li>&#x7D2B;&#x971E;&#x4ED9;&#x5B50;&#xFF1A;&#x201C;&#x6211;&#x7684;&#x610F;&#x4E2D;&#x4EBA;&#x662F;&#x4E2A;&#x76D6;&#x4E16;&#x82F1;&#x96C4;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x4ED6;&#x4F1A;&#x8E29;&#x7740;&#x4E03;&#x8272;&#x4E91;&#x5F69;&#x6765;&#x5A36;&#x6211;&#xFF0C;&#x6211;&#x53EA;&#x731C;&#x4E2D;&#x4E86;&#x524D;&#x5934;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x5374;&#x731C;&#x4E0D;&#x4E2D;&#x8FD9;&#x7ED3;&#x5C40;&#x3002;&#x201D;</li>
</ul>
</li>
<li><p><strong>&#x5927;&#x5185;&#x5BC6;&#x63A2;&#x3001;&#x56FD;&#x4EA7;&#x51CC;&#x51CC;&#x6F06;</strong>&#xFF0C;&#x539F;&#x6765;007&#x53EF;&#x4EE5;&#x4E0D;&#x90A3;&#x4E48;&#x6F47;&#x6D12;&#xFF0C;&#x5374;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5947;&#x8469;&#xFF0C;&#x4E0D;&#x4F18;&#x79C0;&#x4E5F;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;<br>  &#x7ECF;&#x5178;&#x6865;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x8BA9;&#x4EBA;&#x60F3;&#x6B7B;&#x7684;&#x540E;&#x5BAB;&#x4F73;&#x4E3D;&#x4E09;&#x5343;&#xFF0C;&#x8C8C;&#x4F3C;&#x5386;&#x53F2;&#x4E0A;&#x7684;&#x540E;&#x5BAB;&#x6BD4;&#x7247;&#x4E2D;&#x7684;&#x60C5;&#x5F62;&#x597D;&#x4E0D;&#x4E86;&#x591A;&#x5C11;&#x3002;</li>
<li>&#x4E00;&#x6BB5;&#x6A21;&#x4EFF;&#x5965;&#x65AF;&#x5361;&#x9881;&#x5956;&#x7684;&#x573A;&#x9762;&#xFF0C;&#x6700;&#x4F73;&#x7537;&#x4E3B;&#x89D2;&#x662F;&#x7247;&#x4E2D;&#x7537;&#x4E3B;&#x89D2;&#x7684;&#x5CB3;&#x7236;&#x3002;</li>
<li>&#x5993;&#x5973;&#x9053;&#xFF1A;&#x201C;&#x4F60;&#x4EE5;&#x4E3A;&#x8EB2;&#x8D77;&#x6765;&#x5C31;&#x627E;&#x4E0D;&#x5230;&#x4F60;&#x4E86;&#x5417;&#xFF1F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#xFF01;&#x8C61;&#x4F60;&#x8FD9;&#x6837;&#x62C9;&#x98CE;&#x7684;&#x7537;&#x4EBA;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF0C;&#x90FD;&#x50CF;&#x6F06;&#x9ED1;&#x4E2D;&#x7684;&#x8424;&#x706B;&#x866B;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x9C9C;&#x660E;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x51FA;&#x4F17;&#x3002;&#x4F60;&#x90A3;&#x5FE7;&#x90C1;&#x7684;&#x773C;&#x795E;&#xFF0C;&#x7A00;&#x5618;&#x7684;&#x80E1;&#x55B3;&#x5B50;&#xFF0C;&#x795E;&#x4E4E;&#x5176;&#x795E;&#x7684;&#x5200;&#x6CD5;&#xFF0C;&#x548C;&#x90A3;&#x676F;Dry Martine&#xFF0C;&#x90FD;&#x6DF1;&#x6DF1;&#x5730;&#x8FF7;&#x4F4F;&#x4E86;&#x6211;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x51FA;&#x8272;&#xFF0C;&#x4F46;&#x662F;&#x884C;&#x6709;&#x884C;&#x89C4;&#xFF0C;&#x65E0;&#x8BBA;&#x600E;&#x6837;&#x4F60;&#x8981;&#x4ED8;&#x6E05;&#x6628;&#x665A;&#x7684;&#x8FC7;&#x591C;&#x8D39;&#x5440;&#xFF0C;&#x53EB;&#x9E21;&#x4E0D;&#x7528;&#x7ED9;&#x94B1;&#x5417;&#xFF1F;&#x201D;</li>
<li>007&#x90A3;&#x4E9B;&#x4E00;&#x4F1A;&#x513F;&#x6B63;&#x5E38;&#x4E00;&#x4F1A;&#x513F;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x98DE;&#x5200;&#x7EDD;&#x6280;&#x3002;</li>
<li>&#x53F8;&#x4EE4;&#x548C;&#x674E;&#x9999;&#x7434;&#x7528;&#x9A6C;&#x6876;&#x901A;&#x8BAF;&#xFF0C;&#x9053;&#xFF1A;&#x201C;&#x95ED;&#x5634;&#xFF0C;&#x4F60;&#x4EE5;&#x4EC0;&#x4E48;&#x8EAB;&#x4EFD;&#x6765;&#x95EE;&#x6211;&#xFF0C;&#x4ED6;&#x662F;&#x4EC0;&#x4E48;&#x4EBA;&#x8DDF;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF1F;&#x4F60;&#x5988;&#x5988;&#x662F;&#x6C49;&#x5978;&#xFF0C;&#x4F60;&#x7238;&#x7238;&#x662F;&#x8D70;&#x72D7;&#xFF0C;&#x4F60;&#x7237;&#x7237;&#x662F;&#x5356;&#x56FD;&#x8D3C;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x6C49;&#x5978;&#x3001;&#x8D70;&#x72D7;&#x3001;&#x5356;&#x56FD;&#x8D3C;&#x7684;&#x751F;&#x7684;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#xFF0C;&#x5F53;&#x5E74;&#x8981;&#x4E0D;&#x662F;&#x6211;&#x6536;&#x7559;&#x4F60;&#xFF0C;&#x4F60;&#x65E9;&#x5C31;&#x8DDF;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5B8C;&#x86CB;&#x5566;&#xFF0C;&#x4F60;&#x7684;&#x547D;&#x662F;&#x6211;&#x6361;&#x56DE;&#x6765;&#x7684;&#xFF0C;&#x6211;&#x53EB;&#x4F60;&#x600E;&#x4E48;&#x529E;&#x4F60;&#x5C31;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#xFF1F;&#x963F;&#x7434;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x4F60;&#x8FD9;&#x4E2A;&#x4EBA;&#x6709;&#x65F6;&#x5019;&#x5FC3;&#x80A0;&#x592A;&#x8F6F;&#xFF0C;&#x4F60;&#x77E5;&#x4E0D;&#x77E5;&#x9053;007&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x7684;&#x4EBA;&#xFF1F;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x8863;&#x51A0;&#x79BD;&#x517D;&#x3001;&#x4ED6;&#x4EE5;&#x524D;&#x65E0;&#x6076;&#x4E0D;&#x4F5C;&#xFF0C;&#x4E0D;&#x4F46;&#x5F3A;&#x5978;&#x5927;&#x809A;&#x5B50;&#xFF0C;&#x800C;&#x4E14;&#x975E;&#x793C;&#x5C0F;&#x5973;&#x5B69;&#xFF0C;&#x4F60;&#x770B;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x5973;&#x5B69;&#x591A;&#x53EF;&#x7231;&#x554A;&#xFF01;&#x8FD9;&#x4E9B;&#x5927;&#x809A;&#x5B50;&#x53C8;&#x591A;&#x51C4;&#x6B8B;&#xFF0C;&#x90FD;&#x662F;&#x4ED6;&#x5E72;&#x7684;&#x597D;&#x4E8B;&#x5440;&#x3002;&#x4F60;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E3A;&#x6C11;&#x9664;&#x5BB3;&#xFF0C;&#x4F60;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#xFF1F;&#x201D;</li>
<li>&#x5211;&#x573A;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x778E;&#x5B50;&#x88AB;&#x8BA4;&#x5B9A;&#x5077;&#x770B;&#x673A;&#x5BC6;&#x6587;&#x4EF6;&#xFF0C;&#x88AB;&#x67AA;&#x6BD9;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B98;&#x4E8C;&#x4EE3;&#xFF0C;&#x8FD8;&#x662F;&#x88AB;&#x67AA;&#x6BD9;&#x3002;&#x7B2C;&#x4E09;&#x4E2A;&#x6B66;&#x6797;&#x9AD8;&#x624B;&#x8981;&#x8DD1;&#x8DEF;&#xFF0C;&#x88AB;&#x70AE;&#x8F70;&#x4E86;&#x3002;&#x672B;&#x4E86;&#xFF0C;007&#x7528;&#x4E00;&#x5F20;&#x949E;&#x7968;&#x5168;&#x8EAB;&#x800C;&#x9000;&#x3002;</li>
</ul>
</li>
<li><p><strong>&#x559C;&#x5267;&#x4E4B;&#x738B;&#x3001;&#x5C11;&#x6797;&#x8DB3;&#x7403;&#x3001;&#x529F;&#x592B;</strong>&#xFF0C;&#x8349;&#x6839;&#x7684;&#x594B;&#x6597;&#x751F;&#x6D3B;&#xFF0C;&#x50CF;&#x6781;&#x4E86;&#x963F;Q&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x300A;&#x529F;&#x592B;&#x300B;&#x91CC;&#x9762;&#x7684;&#x963F;&#x661F;&#xFF0C;&#x5374;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8FB9;&#x987A;&#x4ECE;&#x8FB9;&#x9003;&#x907F;&#x7684;&#x963F;Q&#xFF0C;&#x800C;&#x662F;&#x6709;&#x70B9;&#x6D41;&#x6C13;&#x6C14;&#xFF0C;&#x6709;&#x70B9;&#x5584;&#x826F;&#xFF0C;&#x4E0D;&#x505C;&#x6323;&#x624E;&#x53CD;&#x6297;&#x7684;&#x963F;Q&#x3002;<br>  &#x7ECF;&#x5178;&#x6865;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x5C39;&#x5929;&#x4EC7;&#x5BF9;&#x67F3;&#x98D8;&#x98D8;&#xFF1A;&#x201C;&#x5176;&#x5B9E;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x6F14;&#x5458;&#x3002;&#x201D;</li>
<li>&#x7528;&#x6F14;&#x6280;&#x6559;&#x4E00;&#x4E2A;&#x65AF;&#x6587;&#x4EBA;&#x53BB;&#x6536;&#x4FDD;&#x62A4;&#x8D39;&#x3002;</li>
<li>&#x547D;&#x8FD0;&#x771F;&#x662F;&#x4E0D;&#x516C;&#x5E73;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8FD9;&#x4E48;&#x5E05;&#x5374;&#x8981;&#x6389;&#x5934;&#x53D1;&#xFF0C;&#x4F60;&#x4EEC;&#x957F;&#x7684;&#x90A3;&#x4E48;&#x4E11;&#x5374;&#x4E0D;&#x6389;&#x5934;&#x53D1;&#x3002;</li>
<li>&#x8D75;&#x8587;&#xFF1A;&#x201C;&#x6211;&#x60F3;&#x5E2E;&#x4F60;&#x4EEC;&#x6BD4;&#x8D5B;&#x3002;&#x201D;&#x5468;&#x661F;&#x9A70;&#xFF1A;&#x201C;&#x4F60;&#x600E;&#x4E48;&#x5E2E;&#xFF1F;&#x4F60;&#x5FEB;&#x70B9;&#x56DE;&#x706B;&#x661F;&#x5427;&#xFF0C;&#x5730;&#x7403;&#x662F;&#x5F88;&#x5371;&#x9669;&#x6EF4;&#x3002;&#x201D;</li>
<li>&#x963F;&#x661F;&#x548C;&#x80A5;&#x4ED4;&#x6536;&#x79DF;&#x6B3A;&#x8F6F;&#x6015;&#x786C;&#xFF0C;&#x6697;&#x7BAD;&#x81EA;&#x4F24;&#x3002;</li>
<li>&#x4E5E;&#x4E10;&#x9053;&#xFF1A;&#x201C;&#x5C0F;&#x5B50;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x9AA8;&#x9ABC;&#x60CA;&#x5947;&#xFF0C;&#x5FC5;&#x662F;&#x7EC3;&#x6B66;&#x5947;&#x624D;&#xFF0C;&#x5C06;&#x6765;&#x7EF4;&#x62A4;&#x5B87;&#x5B99;&#x6B63;&#x4E49;&#x4E0E;&#x548C;&#x5E73;&#x7684;&#x91CD;&#x4EFB;&#x5C31;&#x4EA4;&#x7ED9;&#x4F60;&#x4E86;&#xFF01;&#x6211;&#x8FD9;&#x6709;&#x672C;&#x300A;&#x5982;&#x6765;&#x795E;&#x638C;&#x300B;&#xFF0C;&#x539F;&#x4EF7;13&#x5757;8&#xFF0C;&#x7B97;&#x4F60;10&#x5757;&#x94B1;&#x4E00;&#x672C;&#xFF01;&#x201D;&#x8BBD;&#x523A;&#x7684;&#x662F;&#x5957;&#x8DEF;&#x3002;</li>
<li>&#x5305;&#x79DF;&#x5A46;&#xFF1A;&#x201C;&#x4F60;&#x4EE5;&#x4E3A;&#x4F1A;&#x529F;&#x592B;&#x5C31;&#x4E0D;&#x662F;&#x5154;&#x5B50;&#x5417;&#xFF1F;&#x201D;&#x88C1;&#x7F1D;&#x54ED;&#x4E86;&#xFF1A;&#x201C;&#x4F1A;&#x529F;&#x592B;&#x4E0D;&#x662F;&#x7F6A;&#x554A;&#x3002;&#x201D;&#x5305;&#x79DF;&#x5A46;&#xFF1A;&#x201C;&#x4F60;&#x4E00;&#x65E5;&#x662F;&#x5154;&#x5B50;&#xFF0C;&#x7EC8;&#x751F;&#x662F;&#x5154;&#x5B50;&#x3002;&#x4F60;&#x770B;&#x770B;&#x4F60;&#xFF0C;&#x7A7F;&#x6761;&#x7EA2;&#x5185;&#x88E4;&#xFF0C;&#x767D;&#x91CC;&#x900F;&#x7EA2;&#xFF0C;&#x51FA;&#x6765;&#x5E86;&#x529F;&#x5417;&#xFF1F;&#x201D;</li>
</ul>
</li>
</ul>
<blockquote>
<p>&#x4EE5;&#x4E0B;&#x662F;2008-2016&#x90E8;&#x5206;&#x4F5C;&#x54C1;</p>
</blockquote>
<ul>
<li><strong>&#x957F;&#x6C5F;7&#x53F7;</strong>&#xFF0C;&#x7B97;&#x662F;&#x6E29;&#x99A8;&#x7684;&#xFF0C;&#x5851;&#x9020;&#x7684;&#x5E95;&#x5C42;&#x4EBA;&#x7269;&#x4E0D;&#x9519;&#x4F46;&#x662F;&#x4E0D;&#x591F;&#x7CBE;&#x5F69;&#x3002;</li>
<li><strong>&#x897F;&#x6E38;&#xB7;&#x964D;&#x9B54;&#x7BC7;</strong>&#xFF0C;&#x4E3A;&#x4E86;&#x641E;&#x7B11;&#x800C;&#x641E;&#x7B11;&#xFF0C;&#x8D8A;&#x662F;&#x8FCE;&#x5408;&#x4F17;&#x4EBA;&#xFF0C;&#x8D8A;&#x662F;&#x5BB9;&#x6613;&#x5931;&#x5BA0;&#x3002;</li>
<li><strong>&#x7F8E;&#x4EBA;&#x9C7C;</strong>&#xFF0C;&#x4E0D;&#x641E;&#x7B11;&#xFF0C;&#x9664;&#x4E86;&#x7968;&#x623F;&#x9AD8;&#xFF0C;&#x8FD8;&#x80FD;&#x60F3;&#x8D77;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F20;&#x96E8;&#x7EEE;&#x7684;&#x5927;&#x80F8;&#x3002;</li>
</ul>
<p>&#x661F;&#x7237;&#x7684;&#x7535;&#x5F71;&#x662F;&#x600E;&#x4E48;&#x4E86;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x5546;&#x4E1A;&#x5316;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x6CA1;&#x6709;&#x5473;&#x9053;&#x4E86;&#x3002;</p>
<p>&#x661F;&#x7237;&#x8001;&#x4E86;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x9003;&#x4E0D;&#x8FC7;&#x6240;&#x8C13;&#x7684;&#x4E8B;&#x4E1A;&#x4EBA;&#x751F;&#x8D77;&#x4F0F;&#x5B9A;&#x5F8B;&#xFF0C;&#x8BF7;&#x60A8;&#x5FEB;&#x5FEB;&#x597D;&#x8D77;&#x6765;&#xFF0C;&#x8BF7;&#x60A8;&#x7EE7;&#x7EED;&#x805A;&#x7126;&#x5E95;&#x5C42;&#x4EBA;&#x6C11;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x8BF7;&#x60A8;&#x7EE7;&#x7EED;&#x628A;&#x4E16;&#x4E8B;&#x7684;&#x6CEA;&#x70B9;&#x8F6C;&#x6362;&#x6210;&#x7B11;&#x70B9;&#x5427;&#xFF0C;&#x4F8B;&#x5982;&#x6BCD;&#x4EB2;&#x5356;&#x59D0;&#x59D0;&#xFF0C;&#x59B9;&#x59B9;&#x5E2E;&#x7740;&#x6570;&#x94B1;&#xFF1B;&#x5356;&#x80BE;&#x4E70;&#x82F9;&#x679C;&#xFF1B;&#x513F;&#x5B50;&#x662F;&#x9694;&#x58C1;&#x8001;&#x738B;&#x7684;&#x2026;&#x2026;</p>
<p>&#x661F;&#x7237;&#xFF0C;&#x5343;&#x4E07;&#x4E07;&#x4E2A;&#x6211;&#x4E00;&#x76F4;&#x7AD9;&#x5728;&#x60A8;&#x7684;&#x80CC;&#x540E;&#x3002;</p>

      
    </div>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/08/02/redis1/" id="article-nav-newer" class="article-nav-link-wrap">
      <strong class="article-nav-caption"><</strong>
      <div class="article-nav-title">
        
          redis出坑记
        
      </div>
    </a>
  
  
    <a href="/2016/07/28/spider1/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">爬虫之路（1）</div>
      <strong class="article-nav-caption">></strong>
    </a>
  
</nav>

  
</article>


<div class="share_jia">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">Share to: &nbsp; </span>
		<a class="jiathis_button_facebook"></a> 
    <a class="jiathis_button_twitter"></a>
    <a class="jiathis_button_plus"></a> 
    <a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
    <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>




<div class="share_addthis">
  <div class="sharing addthis_toolbox share">
    <a class="addthis_button_facebook_like"></a>
    <a class="addthis_button_tweet"></a>
    <a class="addthis_button_google_plusone" g:plusone:size="medium"></a>
    <a class="addthis_counter addthis_pill_style"></a>
  </div>
  <script type="text/javascript" src="//s7.addthis.com/js/300/addthis_widget.js#pubid=ra-560c64c35486b3d4" async="async"></script>
</div>




<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="axing" data-title="星爷的背影变小了" data-url="http://yoursite.com/2016/08/01/axing/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"fangjueci"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>



</div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 listen
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
    <script type="text/javascript">
      (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
      (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
      e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
      })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');
      
      _st('install','hPJFSMYvMX8XnCRm-L2e','2.0.0');
    </script>
  </div>
</footer>
    </div>
    
  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">


<script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: true,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false
	}
</script>
<script src="http://7.url.cn/edu/jslib/comb/require-2.1.6,jquery-1.9.1.min.js"></script>
<script src="/js/main.js"></script>






<script type="text/x-mathjax-config">
MathJax.Hub.Config({
    tex2jax: {
        inlineMath: [ ['$','$'], ["\\(","\\)"]  ],
        processEscapes: true,
        skipTags: ['script', 'noscript', 'style', 'textarea', 'pre', 'code']
    }
});

MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
        all[i].SourceElement().parentNode.className += ' has-jax';                 
    }       
});
</script>

<script type="text/javascript" src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>


  </div>
</body>
</html>